app/controllers/sales_controller.rb

SELECT "sales".* FROM "sales"
---
  def index
#    debugger
    if params[:cities ] then
      @sales = filter_by_city(params[:cities] )
    else
    @sales = Sale.all

SELECT "sales".* FROM "sales" WHERE "sales"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @sale = Sale.find(params[:id])